package com.cybermaze.features.level_05

@Suppress("SpellCheckingInspection")
val LEVEL_05_MAP: Array<String> = arrayOf(
    //   0         1         2
    //   0123456789012345678901234567
    "###########################", // 0
    "#Xoo.....oooo.....ooo....o#", // 1 - точки разбросаны
    "#.#####.###.#####.###.###.#", // 2
    "#.#o..#.#o.....#.#oo...#o.#", // 3 - точки в тупиках
    "#.#.#.#.#.#####.#.#.###.#.#", // 4
    "#..o#.o.#.#.......#.#.#..o#", // 5 - точки в узких проходах
    "#.###.###.#.#.#####.#.#.###", // 6
    "#.#o..#...#.#..o....#.#...#", // 7 - точки за углами
    "#.#.###.###.#########.###.#", // 8
    "#ooo..o.o.oooooo.ooo.oooE.#", // 9 - много точек перед выходом
    "###########################"  // 10

)

